Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz4010ca90144.h
#define PIN_PA13A_EIC_EXTINT13                     _UINT32_(13)
#define MUX_PA13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PA13A_EIC_EXTINT13                  ((PIN_PA13A_EIC_EXTINT13 << 16) | MUX_PA13A_EIC_EXTINT13)
#define PORT_PA13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PA13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PA13 External Interrupt Line */

#define PIN_PA29A_EIC_EXTINT13                     _UINT32_(29)
#define MUX_PA29A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PA29A_EIC_EXTINT13                  ((PIN_PA29A_EIC_EXTINT13 << 16) | MUX_PA29A_EIC_EXTINT13)
#define PORT_PA29A_EIC_EXTINT13                    (_UINT32_(1) << 29)
#define PIN_PA29A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PA29 External Interrupt Line */

#define PIN_PB13A_EIC_EXTINT13                     _UINT32_(45)
#define MUX_PB13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PB13A_EIC_EXTINT13                  ((PIN_PB13A_EIC_EXTINT13 << 16) | MUX_PB13A_EIC_EXTINT13)
#define PORT_PB13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PB13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PB13 External Interrupt Line */

#define PIN_PC13A_EIC_EXTINT13                     _UINT32_(77)
#define MUX_PC13A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PC13A_EIC_EXTINT13                  ((PIN_PC13A_EIC_EXTINT13 << 16) | MUX_PC13A_EIC_EXTINT13)
#define PORT_PC13A_EIC_EXTINT13                    (_UINT32_(1) << 13)
#define PIN_PC13A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PC13 External Interrupt Line */

#define PIN_PC29A_EIC_EXTINT13                     _UINT32_(93)
#define MUX_PC29A_EIC_EXTINT13                     _UINT32_(0) 
#define PINMUX_PC29A_EIC_EXTINT13                  ((PIN_PC29A_EIC_EXTINT13 << 16) | MUX_PC29A_EIC_EXTINT13)
#define PORT_PC29A_EIC_EXTINT13                    (_UINT32_(1) << 29)
#define PIN_PC29A_EIC_EXTINT_NUM                   _UINT32_(13) /* EIC signal: PIN_PC29 External Interrupt Line */

#define PIN_PA14A_EIC_EXTINT14                     _UINT32_(14)
#define MUX_PA14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PA14A_EIC_EXTINT14                  ((PIN_PA14A_EIC_EXTINT14 << 16) | MUX_PA14A_EIC_EXTINT14)
#define PORT_PA14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PA14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PA14 External Interrupt Line */

#define PIN_PB14A_EIC_EXTINT14                     _UINT32_(46)
#define MUX_PB14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PB14A_EIC_EXTINT14                  ((PIN_PB14A_EIC_EXTINT14 << 16) | MUX_PB14A_EIC_EXTINT14)
#define PORT_PB14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PB14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PB14 External Interrupt Line */

#define PIN_PC14A_EIC_EXTINT14                     _UINT32_(78)
#define MUX_PC14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PC14A_EIC_EXTINT14                  ((PIN_PC14A_EIC_EXTINT14 << 16) | MUX_PC14A_EIC_EXTINT14)
#define PORT_PC14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PC14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PC14 External Interrupt Line */

#define PIN_PD13A_EIC_EXTINT14                     _UINT32_(109)
#define MUX_PD13A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PD13A_EIC_EXTINT14                  ((PIN_PD13A_EIC_EXTINT14 << 16) | MUX_PD13A_EIC_EXTINT14)
#define PORT_PD13A_EIC_EXTINT14                    (_UINT32_(1) << 13)
#define PIN_PD13A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PD13 External Interrupt Line */

#define PIN_PA15A_EIC_EXTINT15                     _UINT32_(15)
#define MUX_PA15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PA15A_EIC_EXTINT15                  ((PIN_PA15A_EIC_EXTINT15 << 16) | MUX_PA15A_EIC_EXTINT15)
#define PORT_PA15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PA15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PA15 External Interrupt Line */

#define PIN_PB15A_EIC_EXTINT15                     _UINT32_(47)
#define MUX_PB15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB15A_EIC_EXTINT15                  ((PIN_PB15A_EIC_EXTINT15 << 16) | MUX_PB15A_EIC_EXTINT15)
#define PORT_PB15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PB15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB15 External Interrupt Line */

#define PIN_PC15A_EIC_EXTINT15                     _UINT32_(79)
#define MUX_PC15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC15A_EIC_EXTINT15                  ((PIN_PC15A_EIC_EXTINT15 << 16) | MUX_PC15A_EIC_EXTINT15)
#define PORT_PC15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PC15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC15 External Interrupt Line */

#define PIN_PD14A_EIC_EXTINT15                     _UINT32_(110)
#define MUX_PD14A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PD14A_EIC_EXTINT15                  ((PIN_PD14A_EIC_EXTINT15 << 16) | MUX_PD14A_EIC_EXTINT15)
#define PORT_PD14A_EIC_EXTINT15                    (_UINT32_(1) << 14)
#define PIN_PD14A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PD14 External Interrupt Line */

#define PIN_PC20A_EIC_NMI                          _UINT32_(84)
#define MUX_PC20A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PC20A_EIC_NMI                       ((PIN_PC20A_EIC_NMI << 16) | MUX_PC20A_EIC_NMI)
#define PORT_PC20A_EIC_NMI                         (_UINT32_(1) << 20)

/* ========== PORT definition for ETH peripheral ========== */
#define PIN_PD08K_ETH_COL                          _UINT32_(104)
#define MUX_PD08K_ETH_COL                          _UINT32_(10)
#define PINMUX_PD08K_ETH_COL                       ((PIN_PD08K_ETH_COL << 16) | MUX_PD08K_ETH_COL)
#define PORT_PD08K_ETH_COL                         (_UINT32_(1) << 8)

#define PIN_PD09K_ETH_CRS                          _UINT32_(105)
#define MUX_PD09K_ETH_CRS                          _UINT32_(10)
#define PINMUX_PD09K_ETH_CRS                       ((PIN_PD09K_ETH_CRS << 16) | MUX_PD09K_ETH_CRS)
#define PORT_PD09K_ETH_CRS                         (_UINT32_(1) << 9)

#define PIN_PD05L_ETH_GTX_CLK                      _UINT32_(101)
#define MUX_PD05L_ETH_GTX_CLK                      _UINT32_(11)
#define PINMUX_PD05L_ETH_GTX_CLK                   ((PIN_PD05L_ETH_GTX_CLK << 16) | MUX_PD05L_ETH_GTX_CLK)
#define PORT_PD05L_ETH_GTX_CLK                     (_UINT32_(1) << 5)

#define PIN_PA03K_ETH_MDC                          _UINT32_(3) 
#define MUX_PA03K_ETH_MDC                          _UINT32_(10)
#define PINMUX_PA03K_ETH_MDC                       ((PIN_PA03K_ETH_MDC << 16) | MUX_PA03K_ETH_MDC)
#define PORT_PA03K_ETH_MDC                         (_UINT32_(1) << 3)

#define PIN_PA04K_ETH_MDIO                         _UINT32_(4) 
#define MUX_PA04K_ETH_MDIO                         _UINT32_(10)
#define PINMUX_PA04K_ETH_MDIO                      ((PIN_PA04K_ETH_MDIO << 16) | MUX_PA04K_ETH_MDIO)
#define PORT_PA04K_ETH_MDIO                        (_UINT32_(1) << 4)

#define PIN_PD12K_ETH_REF_CLK                      _UINT32_(108)
#define MUX_PD12K_ETH_REF_CLK                      _UINT32_(10)
#define PINMUX_PD12K_ETH_REF_CLK                   ((PIN_PD12K_ETH_REF_CLK << 16) | MUX_PD12K_ETH_REF_CLK)
#define PORT_PD12K_ETH_REF_CLK                     (_UINT32_(1) << 12)

#define PIN_PD11K_ETH_RXD0                         _UINT32_(107)
#define MUX_PD11K_ETH_RXD0                         _UINT32_(10)
#define PINMUX_PD11K_ETH_RXD0                      ((PIN_PD11K_ETH_RXD0 << 16) | MUX_PD11K_ETH_RXD0)
#define PORT_PD11K_ETH_RXD0                        (_UINT32_(1) << 11)

