Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz4010ca90144.h
#define PIN_PC02J_SPI_IXS0_SDI                     _UINT32_(66)
#define MUX_PC02J_SPI_IXS0_SDI                     _UINT32_(9) 
#define PINMUX_PC02J_SPI_IXS0_SDI                  ((PIN_PC02J_SPI_IXS0_SDI << 16) | MUX_PC02J_SPI_IXS0_SDI)
#define PORT_PC02J_SPI_IXS0_SDI                    (_UINT32_(1) << 2)

#define PIN_PD03J_SPI_IXS0_SDI                     _UINT32_(99)
#define MUX_PD03J_SPI_IXS0_SDI                     _UINT32_(9) 
#define PINMUX_PD03J_SPI_IXS0_SDI                  ((PIN_PD03J_SPI_IXS0_SDI << 16) | MUX_PD03J_SPI_IXS0_SDI)
#define PORT_PD03J_SPI_IXS0_SDI                    (_UINT32_(1) << 3)

#define PIN_PC03J_SPI_IXS0_SDO                     _UINT32_(67)
#define MUX_PC03J_SPI_IXS0_SDO                     _UINT32_(9) 
#define PINMUX_PC03J_SPI_IXS0_SDO                  ((PIN_PC03J_SPI_IXS0_SDO << 16) | MUX_PC03J_SPI_IXS0_SDO)
#define PORT_PC03J_SPI_IXS0_SDO                    (_UINT32_(1) << 3)

#define PIN_PD05J_SPI_IXS0_SDO                     _UINT32_(101)
#define MUX_PD05J_SPI_IXS0_SDO                     _UINT32_(9) 
#define PINMUX_PD05J_SPI_IXS0_SDO                  ((PIN_PD05J_SPI_IXS0_SDO << 16) | MUX_PD05J_SPI_IXS0_SDO)
#define PORT_PD05J_SPI_IXS0_SDO                    (_UINT32_(1) << 5)

/* ========== PORT definition for SQI0 peripheral ========== */
#define PIN_PC08H_SQI0_CLK                         _UINT32_(72)
#define MUX_PC08H_SQI0_CLK                         _UINT32_(7) 
#define PINMUX_PC08H_SQI0_CLK                      ((PIN_PC08H_SQI0_CLK << 16) | MUX_PC08H_SQI0_CLK)
#define PORT_PC08H_SQI0_CLK                        (_UINT32_(1) << 8)

#define PIN_PC13H_SQI0_CS0                         _UINT32_(77)
#define MUX_PC13H_SQI0_CS0                         _UINT32_(7) 
#define PINMUX_PC13H_SQI0_CS0                      ((PIN_PC13H_SQI0_CS0 << 16) | MUX_PC13H_SQI0_CS0)
#define PORT_PC13H_SQI0_CS0                        (_UINT32_(1) << 13)

#define PIN_PC15H_SQI0_CS1                         _UINT32_(79)
#define MUX_PC15H_SQI0_CS1                         _UINT32_(7) 
#define PINMUX_PC15H_SQI0_CS1                      ((PIN_PC15H_SQI0_CS1 << 16) | MUX_PC15H_SQI0_CS1)
#define PORT_PC15H_SQI0_CS1                        (_UINT32_(1) << 15)

#define PIN_PC09H_SQI0_DATA0                       _UINT32_(73)
#define MUX_PC09H_SQI0_DATA0                       _UINT32_(7) 
#define PINMUX_PC09H_SQI0_DATA0                    ((PIN_PC09H_SQI0_DATA0 << 16) | MUX_PC09H_SQI0_DATA0)
#define PORT_PC09H_SQI0_DATA0                      (_UINT32_(1) << 9)

#define PIN_PC10H_SQI0_DATA1                       _UINT32_(74)
#define MUX_PC10H_SQI0_DATA1                       _UINT32_(7) 
#define PINMUX_PC10H_SQI0_DATA1                    ((PIN_PC10H_SQI0_DATA1 << 16) | MUX_PC10H_SQI0_DATA1)
#define PORT_PC10H_SQI0_DATA1                      (_UINT32_(1) << 10)

#define PIN_PC11H_SQI0_DATA2                       _UINT32_(75)
#define MUX_PC11H_SQI0_DATA2                       _UINT32_(7) 
#define PINMUX_PC11H_SQI0_DATA2                    ((PIN_PC11H_SQI0_DATA2 << 16) | MUX_PC11H_SQI0_DATA2)
#define PORT_PC11H_SQI0_DATA2                      (_UINT32_(1) << 11)

#define PIN_PC12H_SQI0_DATA3                       _UINT32_(76)
#define MUX_PC12H_SQI0_DATA3                       _UINT32_(7) 
#define PINMUX_PC12H_SQI0_DATA3                    ((PIN_PC12H_SQI0_DATA3 << 16) | MUX_PC12H_SQI0_DATA3)
#define PORT_PC12H_SQI0_DATA3                      (_UINT32_(1) << 12)

/* ========== PORT definition for TCC0 peripheral ========== */
#define PIN_PC00F_TCC0_WO0                         _UINT32_(64)
#define MUX_PC00F_TCC0_WO0                         _UINT32_(5) 
#define PINMUX_PC00F_TCC0_WO0                      ((PIN_PC00F_TCC0_WO0 << 16) | MUX_PC00F_TCC0_WO0)
#define PORT_PC00F_TCC0_WO0                        (_UINT32_(1) << 0)

#define PIN_PC01F_TCC0_WO1                         _UINT32_(65)
#define MUX_PC01F_TCC0_WO1                         _UINT32_(5) 
#define PINMUX_PC01F_TCC0_WO1                      ((PIN_PC01F_TCC0_WO1 << 16) | MUX_PC01F_TCC0_WO1)
#define PORT_PC01F_TCC0_WO1                        (_UINT32_(1) << 1)

#define PIN_PC02F_TCC0_WO2                         _UINT32_(66)
#define MUX_PC02F_TCC0_WO2                         _UINT32_(5) 
#define PINMUX_PC02F_TCC0_WO2                      ((PIN_PC02F_TCC0_WO2 << 16) | MUX_PC02F_TCC0_WO2)
#define PORT_PC02F_TCC0_WO2                        (_UINT32_(1) << 2)

#define PIN_PC03F_TCC0_WO3                         _UINT32_(67)
#define MUX_PC03F_TCC0_WO3                         _UINT32_(5) 
#define PINMUX_PC03F_TCC0_WO3                      ((PIN_PC03F_TCC0_WO3 << 16) | MUX_PC03F_TCC0_WO3)
#define PORT_PC03F_TCC0_WO3                        (_UINT32_(1) << 3)

#define PIN_PC04F_TCC0_WO4                         _UINT32_(68)
#define MUX_PC04F_TCC0_WO4                         _UINT32_(5) 
#define PINMUX_PC04F_TCC0_WO4                      ((PIN_PC04F_TCC0_WO4 << 16) | MUX_PC04F_TCC0_WO4)
#define PORT_PC04F_TCC0_WO4                        (_UINT32_(1) << 4)

#define PIN_PC05F_TCC0_WO5                         _UINT32_(69)
#define MUX_PC05F_TCC0_WO5                         _UINT32_(5) 
#define PINMUX_PC05F_TCC0_WO5                      ((PIN_PC05F_TCC0_WO5 << 16) | MUX_PC05F_TCC0_WO5)
#define PORT_PC05F_TCC0_WO5                        (_UINT32_(1) << 5)

#define PIN_PC06F_TCC0_WO6                         _UINT32_(70)
#define MUX_PC06F_TCC0_WO6                         _UINT32_(5) 
#define PINMUX_PC06F_TCC0_WO6                      ((PIN_PC06F_TCC0_WO6 << 16) | MUX_PC06F_TCC0_WO6)
#define PORT_PC06F_TCC0_WO6                        (_UINT32_(1) << 6)

#define PIN_PC07F_TCC0_WO7                         _UINT32_(71)
#define MUX_PC07F_TCC0_WO7                         _UINT32_(5) 
#define PINMUX_PC07F_TCC0_WO7                      ((PIN_PC07F_TCC0_WO7 << 16) | MUX_PC07F_TCC0_WO7)
#define PORT_PC07F_TCC0_WO7                        (_UINT32_(1) << 7)

/* ========== PORT definition for TCC1 peripheral ========== */
#define PIN_PB10F_TCC1_WO0                         _UINT32_(42)
#define MUX_PB10F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PB10F_TCC1_WO0                      ((PIN_PB10F_TCC1_WO0 << 16) | MUX_PB10F_TCC1_WO0)
#define PORT_PB10F_TCC1_WO0                        (_UINT32_(1) << 10)

